zhengwang721/ASF/sam0/utils/cmsis/samd20/include/samd20128g3.h
/**
 * \file
 *
 * Copyright (c) 2012 Atmel Corporation. All rights reserved.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. The name of Atmel may not be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * 4. This software may only be redistributed and used in connection with an
 *    Atmel microcontroller product.
 *
 * THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * EXPRESSLY AND SPECIFICALLY DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAMD20128G3_
#define _SAMD20128G3_

/** \addtogroup SAMD20128G3_definitions SAMD20128G3 definitions
  This file defines all structures and symbols for SAMD20128G3:
    - registers and bitfields
    - peripheral base address
    - peripheral ID
    - PIO definitions
*/
/*@{*/

#ifdef __cplusplus
 extern "C" {
#endif

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
#include <stdint.h>
#ifndef __cplusplus
typedef volatile const uint32_t RoReg;   /**< Read only 32-bit register (volatile const unsigned int) */
typedef volatile const uint16_t RoReg16; /**< Read only 16-bit register (volatile const unsigned int) */
typedef volatile const uint8_t  RoReg8;  /**< Read only  8-bit register (volatile const unsigned int) */
#else
typedef volatile       uint32_t RoReg;   /**< Read only 32-bit register (volatile const unsigned int) */
typedef volatile       uint16_t RoReg16; /**< Read only 16-bit register (volatile const unsigned int) */
typedef volatile       uint8_t  RoReg8;  /**< Read only  8-bit register (volatile const unsigned int) */
#endif
typedef volatile       uint32_t WoReg;   /**< Write only 32-bit register (volatile unsigned int) */
typedef volatile       uint16_t WoReg16; /**< Write only 16-bit register (volatile unsigned int) */
typedef volatile       uint32_t WoReg8;  /**< Write only  8-bit register (volatile unsigned int) */
typedef volatile       uint32_t RwReg;   /**< Read-Write 32-bit register (volatile unsigned int) */
typedef volatile       uint16_t RwReg16; /**< Read-Write 16-bit register (volatile unsigned int) */
typedef volatile       uint8_t  RwReg8;  /**< Read-Write  8-bit register (volatile unsigned int) */
#define CAST(type, value) ((type *)(value))
#define REG_ACCESS(type, address) (*(type*)(address)) /**< C code: Register value */
#else
#define CAST(type, value) (value)
#define REG_ACCESS(type, address) (address) /**< Assembly code: Register address */
#endif

/* ************************************************************************** */
/**  CMSIS DEFINITIONS FOR SAMD20128G3 */
/* ************************************************************************** */
/** \addtogroup SAMD20128G3_cmsis CMSIS Definitions */
/*@{*/

/**< Interrupt Number Definition */
typedef enum IRQn
{
  /******  Cortex-M0+ Processor Exceptions Numbers *******************************/
  NonMaskableInt_IRQn      = -14, /**<  2 Non Maskable Interrupt                 */
  HardFault_IRQn           = -13, /**<  3 Cortex-M0+ Hard Fault Interrupt        */
  SVCall_IRQn              = -5,  /**< 11 Cortex-M0+ SV Call Interrupt           */
  PendSV_IRQn              = -2,  /**< 14 Cortex-M0+ Pend SV Interrupt           */
  SysTick_IRQn             = -1,  /**< 15 Cortex-M0+ System Tick Interrupt       */
  /******  SAMD20128G3-specific Interrupt Numbers ***********************/
  PM_CFD_IRQn              =  0, /**<  0 SAMD20128G3 Power Manager (PM) */
  PM_CKRDY_IRQn            =  0, /**<  0 SAMD20128G3 Power Manager (PM) */
  SYSCTRL_BOD12DET_IRQn    =  1, /**<  1 SAMD20128G3 System Control (SYSCTRL) */
  SYSCTRL_BOD12RDY_IRQn    =  1, /**<  1 SAMD20128G3 System Control (SYSCTRL) */
  SYSCTRL_BOD12SYNRDY_IRQn =  1, /**<  1 SAMD20128G3 System Control (SYSCTRL) */
  SYSCTRL_BOD33DET_IRQn    =  1, /**<  1 SAMD20128G3 System Control (SYSCTRL) */
  SYSCTRL_BOD33RDY_IRQn    =  1, /**<  1 SAMD20128G3 System Control (SYSCTRL) */
  SYSCTRL_BOD33SYNRDY_IRQn =  1, /**<  1 SAMD20128G3 System Control (SYSCTRL) */
  SYSCTRL_DFLLLOCKC_IRQn   =  1, /**<  1 SAMD20128G3 System Control (SYSCTRL) */
  SYSCTRL_DFLLLOCKF_IRQn   =  1, /**<  1 SAMD20128G3 System Control (SYSCTRL) */
  SYSCTRL_DFLLOOB_IRQn     =  1, /**<  1 SAMD20128G3 System Control (SYSCTRL) */
  SYSCTRL_DFLLRCS_IRQn     =  1, /**<  1 SAMD20128G3 System Control (SYSCTRL) */
  SYSCTRL_DFLLRDY_IRQn     =  1, /**<  1 SAMD20128G3 System Control (SYSCTRL) */
  SYSCTRL_OSC32KRDY_IRQn   =  1, /**<  1 SAMD20128G3 System Control (SYSCTRL) */
  SYSCTRL_XOSCRDY_IRQn     =  1, /**<  1 SAMD20128G3 System Control (SYSCTRL) */
  SYSCTRL_XOSC32RDY_IRQn   =  1, /**<  1 SAMD20128G3 System Control (SYSCTRL) */
  WDT_EW_IRQn              =  2, /**<  2 SAMD20128G3 Watchdog Timer (WDT) */
  RTC_CMP_0_IRQn           =  3, /**<  3 SAMD20128G3 Real-Time Counter (RTC) */
  RTC_CMP_1_IRQn           =  3, /**<  3 SAMD20128G3 Real-Time Counter (RTC) */
  RTC_OVF_IRQn             =  3, /**<  3 SAMD20128G3 Real-Time Counter (RTC) */
  RTC_READY_IRQn           =  3, /**<  3 SAMD20128G3 Real-Time Counter (RTC) */
  EIC_EXTINT_0_IRQn        =  4, /**<  4 SAMD20128G3 External Interrupt Controller (EIC) */
  EIC_EXTINT_1_IRQn        =  4, /**<  4 SAMD20128G3 External Interrupt Controller (EIC) */
  EIC_EXTINT_2_IRQn        =  4, /**<  4 SAMD20128G3 External Interrupt Controller (EIC) */
  EIC_EXTINT_3_IRQn        =  4, /**<  4 SAMD20128G3 External Interrupt Controller (EIC) */
  EIC_EXTINT_4_IRQn        =  4, /**<  4 SAMD20128G3 External Interrupt Controller (EIC) */
  EIC_EXTINT_5_IRQn        =  4, /**<  4 SAMD20128G3 External Interrupt Controller (EIC) */
  EIC_EXTINT_6_IRQn        =  4, /**<  4 SAMD20128G3 External Interrupt Controller (EIC) */
  EIC_EXTINT_7_IRQn        =  4, /**<  4 SAMD20128G3 External Interrupt Controller (EIC) */
  EIC_EXTINT_8_IRQn        =  4, /**<  4 SAMD20128G3 External Interrupt Controller (EIC) */
  EIC_EXTINT_9_IRQn        =  4, /**<  4 SAMD20128G3 External Interrupt Controller (EIC) */
  EIC_EXTINT_10_IRQn       =  4, /**<  4 SAMD20128G3 External Interrupt Controller (EIC) */
  EIC_EXTINT_11_IRQn       =  4, /**<  4 SAMD20128G3 External Interrupt Controller (EIC) */
  EIC_EXTINT_12_IRQn       =  4, /**<  4 SAMD20128G3 External Interrupt Controller (EIC) */
  EIC_EXTINT_13_IRQn       =  4, /**<  4 SAMD20128G3 External Interrupt Controller (EIC) */
  EIC_EXTINT_14_IRQn       =  4, /**<  4 SAMD20128G3 External Interrupt Controller (EIC) */
  EIC_EXTINT_15_IRQn       =  4, /**<  4 SAMD20128G3 External Interrupt Controller (EIC) */
  NVMCTRL_0_IRQn           =  5, /**<  5 SAMD20128G3 Non-Volatile Memory Controller (NVMCTRL) */
  NVMCTRL_1_IRQn           =  5, /**<  5 SAMD20128G3 Non-Volatile Memory Controller (NVMCTRL) */
  EVSYS_EVD_0_IRQn         =  6, /**<  6 SAMD20128G3 Event System Interface (EVSYS) */
  EVSYS_EVD_1_IRQn         =  6, /**<  6 SAMD20128G3 Event System Interface (EVSYS) */
  EVSYS_EVD_2_IRQn         =  6, /**<  6 SAMD20128G3 Event System Interface (EVSYS) */
  EVSYS_EVD_3_IRQn         =  6, /**<  6 SAMD20128G3 Event System Interface (EVSYS) */
  EVSYS_EVD_4_IRQn         =  6, /**<  6 SAMD20128G3 Event System Interface (EVSYS) */
  EVSYS_EVD_5_IRQn         =  6, /**<  6 SAMD20128G3 Event System Interface (EVSYS) */
  EVSYS_EVD_6_IRQn         =  6, /**<  6 SAMD20128G3 Event System Interface (EVSYS) */
  EVSYS_EVD_7_IRQn         =  6, /**<  6 SAMD20128G3 Event System Interface (EVSYS) */
  EVSYS_OVR_0_IRQn         =  6, /**<  6 SAMD20128G3 Event System Interface (EVSYS) */
  EVSYS_OVR_1_IRQn         =  6, /**<  6 SAMD20128G3 Event System Interface (EVSYS) */
  EVSYS_OVR_2_IRQn         =  6, /**<  6 SAMD20128G3 Event System Interface (EVSYS) */
  EVSYS_OVR_3_IRQn         =  6, /**<  6 SAMD20128G3 Event System Interface (EVSYS) */
  EVSYS_OVR_4_IRQn         =  6, /**<  6 SAMD20128G3 Event System Interface (EVSYS) */
  EVSYS_OVR_5_IRQn         =  6, /**<  6 SAMD20128G3 Event System Interface (EVSYS) */
  EVSYS_OVR_6_IRQn         =  6, /**<  6 SAMD20128G3 Event System Interface (EVSYS) */
  EVSYS_OVR_7_IRQn         =  6, /**<  6 SAMD20128G3 Event System Interface (EVSYS) */
  SERCOM0_0_IRQn           =  7, /**<  7 SAMD20128G3 Serial Communication Interface 0 (SERCOM0) */
  SERCOM0_1_IRQn           =  7, /**<  7 SAMD20128G3 Serial Communication Interface 0 (SERCOM0) */
  SERCOM0_2_IRQn           =  7, /**<  7 SAMD20128G3 Serial Communication Interface 0 (SERCOM0) */
  SERCOM0_3_IRQn           =  7, /**<  7 SAMD20128G3 Serial Communication Interface 0 (SERCOM0) */
  SERCOM1_0_IRQn           =  8, /**<  8 SAMD20128G3 Serial Communication Interface 1 (SERCOM1) */
  SERCOM1_1_IRQn           =  8, /**<  8 SAMD20128G3 Serial Communication Interface 1 (SERCOM1) */
  SERCOM1_2_IRQn           =  8, /**<  8 SAMD20128G3 Serial Communication Interface 1 (SERCOM1) */
  SERCOM1_3_IRQn           =  8, /**<  8 SAMD20128G3 Serial Communication Interface 1 (SERCOM1) */
  SERCOM2_0_IRQn           =  9, /**<  9 SAMD20128G3 Serial Communication Interface 2 (SERCOM2) */
  SERCOM2_1_IRQn           =  9, /**<  9 SAMD20128G3 Serial Communication Interface 2 (SERCOM2) */
  SERCOM2_2_IRQn           =  9, /**<  9 SAMD20128G3 Serial Communication Interface 2 (SERCOM2) */
  SERCOM2_3_IRQn           =  9, /**<  9 SAMD20128G3 Serial Communication Interface 2 (SERCOM2) */
  SERCOM3_0_IRQn           = 10, /**< 10 SAMD20128G3 Serial Communication Interface 3 (SERCOM3) */
  SERCOM3_1_IRQn           = 10, /**< 10 SAMD20128G3 Serial Communication Interface 3 (SERCOM3) */
  SERCOM3_2_IRQn           = 10, /**< 10 SAMD20128G3 Serial Communication Interface 3 (SERCOM3) */
  SERCOM3_3_IRQn           = 10, /**< 10 SAMD20128G3 Serial Communication Interface 3 (SERCOM3) */
  SERCOM4_0_IRQn           = 11, /**< 11 SAMD20128G3 Serial Communication Interface 4 (SERCOM4) */
  SERCOM4_1_IRQn           = 11, /**< 11 SAMD20128G3 Serial Communication Interface 4 (SERCOM4) */
  SERCOM4_2_IRQn           = 11, /**< 11 SAMD20128G3 Serial Communication Interface 4 (SERCOM4) */
  SERCOM4_3_IRQn           = 11, /**< 11 SAMD20128G3 Serial Communication Interface 4 (SERCOM4) */
  SERCOM5_0_IRQn           = 12, /**< 12 SAMD20128G3 Serial Communication Interface 5 (SERCOM5) */
  SERCOM5_1_IRQn           = 12, /**< 12 SAMD20128G3 Serial Communication Interface 5 (SERCOM5) */
  SERCOM5_2_IRQn           = 12, /**< 12 SAMD20128G3 Serial Communication Interface 5 (SERCOM5) */
  SERCOM5_3_IRQn           = 12, /**< 12 SAMD20128G3 Serial Communication Interface 5 (SERCOM5) */
  TC0_ERR_IRQn             = 13, /**< 13 SAMD20128G3 Basic Timer Counter 0 (TC0) */
  TC0_MC_0_IRQn            = 13, /**< 13 SAMD20128G3 Basic Timer Counter 0 (TC0) */
  TC0_MC_1_IRQn            = 13, /**< 13 SAMD20128G3 Basic Timer Counter 0 (TC0) */
  TC0_OVF_IRQn             = 13, /**< 13 SAMD20128G3 Basic Timer Counter 0 (TC0) */
  TC0_READY_IRQn           = 13, /**< 13 SAMD20128G3 Basic Timer Counter 0 (TC0) */
  TC1_ERR_IRQn             = 14, /**< 14 SAMD20128G3 Basic Timer Counter 1 (TC1) */
  TC1_MC_0_IRQn            = 14, /**< 14 SAMD20128G3 Basic Timer Counter 1 (TC1) */
  TC1_MC_1_IRQn            = 14, /**< 14 SAMD20128G3 Basic Timer Counter 1 (TC1) */
  TC1_OVF_IRQn             = 14, /**< 14 SAMD20128G3 Basic Timer Counter 1 (TC1) */
  TC1_READY_IRQn           = 14, /**< 14 SAMD20128G3 Basic Timer Counter 1 (TC1) */
  TC2_ERR_IRQn             = 15, /**< 15 SAMD20128G3 Basic Timer Counter 2 (TC2) */
  TC2_MC_0_IRQn            = 15, /**< 15 SAMD20128G3 Basic Timer Counter 2 (TC2) */
  TC2_MC_1_IRQn            = 15, /**< 15 SAMD20128G3 Basic Timer Counter 2 (TC2) */
  TC2_OVF_IRQn             = 15, /**< 15 SAMD20128G3 Basic Timer Counter 2 (TC2) */
  TC2_READY_IRQn           = 15, /**< 15 SAMD20128G3 Basic Timer Counter 2 (TC2) */
  TC3_ERR_IRQn             = 16, /**< 16 SAMD20128G3 Basic Timer Counter 3 (TC3) */
  TC3_MC_0_IRQn            = 16, /**< 16 SAMD20128G3 Basic Timer Counter 3 (TC3) */
  TC3_MC_1_IRQn            = 16, /**< 16 SAMD20128G3 Basic Timer Counter 3 (TC3) */
  TC3_OVF_IRQn             = 16, /**< 16 SAMD20128G3 Basic Timer Counter 3 (TC3) */
  TC3_READY_IRQn           = 16, /**< 16 SAMD20128G3 Basic Timer Counter 3 (TC3) */
  TC4_ERR_IRQn             = 17, /**< 17 SAMD20128G3 Basic Timer Counter 4 (TC4) */
  TC4_MC_0_IRQn            = 17, /**< 17 SAMD20128G3 Basic Timer Counter 4 (TC4) */
  TC4_MC_1_IRQn            = 17, /**< 17 SAMD20128G3 Basic Timer Counter 4 (TC4) */
  TC4_OVF_IRQn             = 17, /**< 17 SAMD20128G3 Basic Timer Counter 4 (TC4) */
  TC4_READY_IRQn           = 17, /**< 17 SAMD20128G3 Basic Timer Counter 4 (TC4) */
  TC5_ERR_IRQn             = 18, /**< 18 SAMD20128G3 Basic Timer Counter 5 (TC5) */
  TC5_MC_0_IRQn            = 18, /**< 18 SAMD20128G3 Basic Timer Counter 5 (TC5) */
  TC5_MC_1_IRQn            = 18, /**< 18 SAMD20128G3 Basic Timer Counter 5 (TC5) */
  TC5_OVF_IRQn             = 18, /**< 18 SAMD20128G3 Basic Timer Counter 5 (TC5) */
  TC5_READY_IRQn           = 18, /**< 18 SAMD20128G3 Basic Timer Counter 5 (TC5) */
  TC6_ERR_IRQn             = 19, /**< 19 SAMD20128G3 Basic Timer Counter 6 (TC6) */
  TC6_MC_0_IRQn            = 19, /**< 19 SAMD20128G3 Basic Timer Counter 6 (TC6) */
  TC6_MC_1_IRQn            = 19, /**< 19 SAMD20128G3 Basic Timer Counter 6 (TC6) */
  TC6_OVF_IRQn             = 19, /**< 19 SAMD20128G3 Basic Timer Counter 6 (TC6) */
  TC6_READY_IRQn           = 19, /**< 19 SAMD20128G3 Basic Timer Counter 6 (TC6) */
  TC7_ERR_IRQn             = 20, /**< 20 SAMD20128G3 Basic Timer Counter 7 (TC7) */
  TC7_MC_0_IRQn            = 20, /**< 20 SAMD20128G3 Basic Timer Counter 7 (TC7) */
  TC7_MC_1_IRQn            = 20, /**< 20 SAMD20128G3 Basic Timer Counter 7 (TC7) */
  TC7_OVF_IRQn             = 20, /**< 20 SAMD20128G3 Basic Timer Counter 7 (TC7) */
  TC7_READY_IRQn           = 20, /**< 20 SAMD20128G3 Basic Timer Counter 7 (TC7) */
  ADC_OVERRUN_IRQn         = 21, /**< 21 SAMD20128G3 Analog Digital Converter (ADC) */
  ADC_READY_IRQn           = 21, /**< 21 SAMD20128G3 Analog Digital Converter (ADC) */
  ADC_RESRDY_IRQn          = 21, /**< 21 SAMD20128G3 Analog Digital Converter (ADC) */
  ADC_WINMON_IRQn          = 21, /**< 21 SAMD20128G3 Analog Digital Converter (ADC) */
  AC_COMP_0_IRQn           = 22, /**< 22 SAMD20128G3 Analog Comparators (AC) */
  AC_COMP_1_IRQn           = 22, /**< 22 SAMD20128G3 Analog Comparators (AC) */
  AC_WIN_0_IRQn            = 22, /**< 22 SAMD20128G3 Analog Comparators (AC) */
  DAC_EMPTY_IRQn           = 23, /**< 23 SAMD20128G3 Digital Analog Converter (DAC) */
  DAC_READY_IRQn           = 23, /**< 23 SAMD20128G3 Digital Analog Converter (DAC) */
  DAC_UNDERRUN_IRQn        = 23, /**< 23 SAMD20128G3 Digital Analog Converter (DAC) */
  PTC_EOC_IRQn             = 24, /**< 24 SAMD20128G3 Peripheral Touch Controller (PTC) */
  PTC_READY_IRQn           = 24, /**< 24 SAMD20128G3 Peripheral Touch Controller (PTC) */
  PTC_WCOMP_IRQn           = 24, /**< 24 SAMD20128G3 Peripheral Touch Controller (PTC) */

