zhengwang721/ASF/sam0/utils/cmsis/samd20/include/samd20128g3.h
  PERIPH_COUNT_IRQn        = 25  /**< Number of peripheral IDs */
} IRQn_Type;

typedef struct _DeviceVectors
{
  /* Stack pointer */
  void* pvStack;

  /* Cortex-M handlers */
  void* pfnReset_Handler;
  void* pfnNonMaskableInt_Handler;
  void* pfnHardFault_Handler;
  void* pfnReservedM12;
  void* pfnReservedM11;
  void* pfnReservedM10;
  void* pfnReservedM9;
  void* pfnReservedM8;
  void* pfnReservedM7;
  void* pfnReservedM6;
  void* pfnSVCall_Handler;
  void* pfnReservedM4;
  void* pfnReservedM3;
  void* pfnPendSV_Handler;
  void* pfnSysTick_Handler;

  /* Peripheral handlers */
  union {
    void* pfnPM_CFD_Handler;              /*  0 Power Manager */
    void* pfnPM_CKRDY_Handler;            /*  0 Power Manager */
  };
  union {
    void* pfnSYSCTRL_BOD12DET_Handler;    /*  1 System Control */
    void* pfnSYSCTRL_BOD12RDY_Handler;    /*  1 System Control */
    void* pfnSYSCTRL_BOD12SYNRDY_Handler; /*  1 System Control */
    void* pfnSYSCTRL_BOD33DET_Handler;    /*  1 System Control */
    void* pfnSYSCTRL_BOD33RDY_Handler;    /*  1 System Control */
    void* pfnSYSCTRL_BOD33SYNRDY_Handler; /*  1 System Control */
    void* pfnSYSCTRL_DFLLLOCKC_Handler;   /*  1 System Control */
    void* pfnSYSCTRL_DFLLLOCKF_Handler;   /*  1 System Control */
    void* pfnSYSCTRL_DFLLOOB_Handler;     /*  1 System Control */
    void* pfnSYSCTRL_DFLLRCS_Handler;     /*  1 System Control */
    void* pfnSYSCTRL_DFLLRDY_Handler;     /*  1 System Control */
    void* pfnSYSCTRL_OSC32KRDY_Handler;   /*  1 System Control */
    void* pfnSYSCTRL_XOSCRDY_Handler;     /*  1 System Control */
    void* pfnSYSCTRL_XOSC32RDY_Handler;   /*  1 System Control */
  };
  void* pfnWDT_EW_Handler;                /*  2 Watchdog Timer */
  union {
    void* pfnRTC_CMP_0_Handler;           /*  3 Real-Time Counter */
    void* pfnRTC_CMP_1_Handler;           /*  3 Real-Time Counter */
    void* pfnRTC_OVF_Handler;             /*  3 Real-Time Counter */
    void* pfnRTC_READY_Handler;           /*  3 Real-Time Counter */
  };
  union {
    void* pfnEIC_EXTINT_0_Handler;        /*  4 External Interrupt Controller */
    void* pfnEIC_EXTINT_1_Handler;        /*  4 External Interrupt Controller */
    void* pfnEIC_EXTINT_2_Handler;        /*  4 External Interrupt Controller */
    void* pfnEIC_EXTINT_3_Handler;        /*  4 External Interrupt Controller */
    void* pfnEIC_EXTINT_4_Handler;        /*  4 External Interrupt Controller */
    void* pfnEIC_EXTINT_5_Handler;        /*  4 External Interrupt Controller */
    void* pfnEIC_EXTINT_6_Handler;        /*  4 External Interrupt Controller */
    void* pfnEIC_EXTINT_7_Handler;        /*  4 External Interrupt Controller */
    void* pfnEIC_EXTINT_8_Handler;        /*  4 External Interrupt Controller */
    void* pfnEIC_EXTINT_9_Handler;        /*  4 External Interrupt Controller */
    void* pfnEIC_EXTINT_10_Handler;       /*  4 External Interrupt Controller */
    void* pfnEIC_EXTINT_11_Handler;       /*  4 External Interrupt Controller */
    void* pfnEIC_EXTINT_12_Handler;       /*  4 External Interrupt Controller */
    void* pfnEIC_EXTINT_13_Handler;       /*  4 External Interrupt Controller */
    void* pfnEIC_EXTINT_14_Handler;       /*  4 External Interrupt Controller */
    void* pfnEIC_EXTINT_15_Handler;       /*  4 External Interrupt Controller */
  };
  union {
    void* pfnNVMCTRL_0_Handler;           /*  5 Non-Volatile Memory Controller */
    void* pfnNVMCTRL_1_Handler;           /*  5 Non-Volatile Memory Controller */
  };
  union {
    void* pfnEVSYS_EVD_0_Handler;         /*  6 Event System Interface */
    void* pfnEVSYS_EVD_1_Handler;         /*  6 Event System Interface */
    void* pfnEVSYS_EVD_2_Handler;         /*  6 Event System Interface */
    void* pfnEVSYS_EVD_3_Handler;         /*  6 Event System Interface */
    void* pfnEVSYS_EVD_4_Handler;         /*  6 Event System Interface */
    void* pfnEVSYS_EVD_5_Handler;         /*  6 Event System Interface */
    void* pfnEVSYS_EVD_6_Handler;         /*  6 Event System Interface */
    void* pfnEVSYS_EVD_7_Handler;         /*  6 Event System Interface */
    void* pfnEVSYS_OVR_0_Handler;         /*  6 Event System Interface */
    void* pfnEVSYS_OVR_1_Handler;         /*  6 Event System Interface */
    void* pfnEVSYS_OVR_2_Handler;         /*  6 Event System Interface */
    void* pfnEVSYS_OVR_3_Handler;         /*  6 Event System Interface */
    void* pfnEVSYS_OVR_4_Handler;         /*  6 Event System Interface */
    void* pfnEVSYS_OVR_5_Handler;         /*  6 Event System Interface */
    void* pfnEVSYS_OVR_6_Handler;         /*  6 Event System Interface */
    void* pfnEVSYS_OVR_7_Handler;         /*  6 Event System Interface */
  };
  union {
    void* pfnSERCOM0_0_Handler;           /*  7 Serial Communication Interface 0 */
    void* pfnSERCOM0_1_Handler;           /*  7 Serial Communication Interface 0 */
    void* pfnSERCOM0_2_Handler;           /*  7 Serial Communication Interface 0 */
    void* pfnSERCOM0_3_Handler;           /*  7 Serial Communication Interface 0 */
  };
  union {
    void* pfnSERCOM1_0_Handler;           /*  8 Serial Communication Interface 1 */
    void* pfnSERCOM1_1_Handler;           /*  8 Serial Communication Interface 1 */
    void* pfnSERCOM1_2_Handler;           /*  8 Serial Communication Interface 1 */
    void* pfnSERCOM1_3_Handler;           /*  8 Serial Communication Interface 1 */
  };
  union {
    void* pfnSERCOM2_0_Handler;           /*  9 Serial Communication Interface 2 */
    void* pfnSERCOM2_1_Handler;           /*  9 Serial Communication Interface 2 */
    void* pfnSERCOM2_2_Handler;           /*  9 Serial Communication Interface 2 */
    void* pfnSERCOM2_3_Handler;           /*  9 Serial Communication Interface 2 */
  };
  union {
    void* pfnSERCOM3_0_Handler;           /* 10 Serial Communication Interface 3 */
    void* pfnSERCOM3_1_Handler;           /* 10 Serial Communication Interface 3 */
    void* pfnSERCOM3_2_Handler;           /* 10 Serial Communication Interface 3 */
    void* pfnSERCOM3_3_Handler;           /* 10 Serial Communication Interface 3 */
  };
  union {
    void* pfnSERCOM4_0_Handler;           /* 11 Serial Communication Interface 4 */
    void* pfnSERCOM4_1_Handler;           /* 11 Serial Communication Interface 4 */
    void* pfnSERCOM4_2_Handler;           /* 11 Serial Communication Interface 4 */
    void* pfnSERCOM4_3_Handler;           /* 11 Serial Communication Interface 4 */
  };
  union {
    void* pfnSERCOM5_0_Handler;           /* 12 Serial Communication Interface 5 */
    void* pfnSERCOM5_1_Handler;           /* 12 Serial Communication Interface 5 */
    void* pfnSERCOM5_2_Handler;           /* 12 Serial Communication Interface 5 */
    void* pfnSERCOM5_3_Handler;           /* 12 Serial Communication Interface 5 */
  };
  union {
    void* pfnTC0_ERR_Handler;             /* 13 Basic Timer Counter 0 */
    void* pfnTC0_MC_0_Handler;            /* 13 Basic Timer Counter 0 */
    void* pfnTC0_MC_1_Handler;            /* 13 Basic Timer Counter 0 */
    void* pfnTC0_OVF_Handler;             /* 13 Basic Timer Counter 0 */
    void* pfnTC0_READY_Handler;           /* 13 Basic Timer Counter 0 */
  };
  union {
    void* pfnTC1_ERR_Handler;             /* 14 Basic Timer Counter 1 */
    void* pfnTC1_MC_0_Handler;            /* 14 Basic Timer Counter 1 */
    void* pfnTC1_MC_1_Handler;            /* 14 Basic Timer Counter 1 */
    void* pfnTC1_OVF_Handler;             /* 14 Basic Timer Counter 1 */
    void* pfnTC1_READY_Handler;           /* 14 Basic Timer Counter 1 */
  };
  union {
    void* pfnTC2_ERR_Handler;             /* 15 Basic Timer Counter 2 */
    void* pfnTC2_MC_0_Handler;            /* 15 Basic Timer Counter 2 */
    void* pfnTC2_MC_1_Handler;            /* 15 Basic Timer Counter 2 */
    void* pfnTC2_OVF_Handler;             /* 15 Basic Timer Counter 2 */
    void* pfnTC2_READY_Handler;           /* 15 Basic Timer Counter 2 */
  };
  union {
    void* pfnTC3_ERR_Handler;             /* 16 Basic Timer Counter 3 */
    void* pfnTC3_MC_0_Handler;            /* 16 Basic Timer Counter 3 */
    void* pfnTC3_MC_1_Handler;            /* 16 Basic Timer Counter 3 */
    void* pfnTC3_OVF_Handler;             /* 16 Basic Timer Counter 3 */
    void* pfnTC3_READY_Handler;           /* 16 Basic Timer Counter 3 */
  };
  union {
    void* pfnTC4_ERR_Handler;             /* 17 Basic Timer Counter 4 */
    void* pfnTC4_MC_0_Handler;            /* 17 Basic Timer Counter 4 */
    void* pfnTC4_MC_1_Handler;            /* 17 Basic Timer Counter 4 */
    void* pfnTC4_OVF_Handler;             /* 17 Basic Timer Counter 4 */
    void* pfnTC4_READY_Handler;           /* 17 Basic Timer Counter 4 */
  };
  union {
    void* pfnTC5_ERR_Handler;             /* 18 Basic Timer Counter 5 */
    void* pfnTC5_MC_0_Handler;            /* 18 Basic Timer Counter 5 */
    void* pfnTC5_MC_1_Handler;            /* 18 Basic Timer Counter 5 */
    void* pfnTC5_OVF_Handler;             /* 18 Basic Timer Counter 5 */
    void* pfnTC5_READY_Handler;           /* 18 Basic Timer Counter 5 */
  };
  union {
    void* pfnTC6_ERR_Handler;             /* 19 Basic Timer Counter 6 */
    void* pfnTC6_MC_0_Handler;            /* 19 Basic Timer Counter 6 */
    void* pfnTC6_MC_1_Handler;            /* 19 Basic Timer Counter 6 */
    void* pfnTC6_OVF_Handler;             /* 19 Basic Timer Counter 6 */
    void* pfnTC6_READY_Handler;           /* 19 Basic Timer Counter 6 */
  };
  union {
    void* pfnTC7_ERR_Handler;             /* 20 Basic Timer Counter 7 */
    void* pfnTC7_MC_0_Handler;            /* 20 Basic Timer Counter 7 */
    void* pfnTC7_MC_1_Handler;            /* 20 Basic Timer Counter 7 */
    void* pfnTC7_OVF_Handler;             /* 20 Basic Timer Counter 7 */
    void* pfnTC7_READY_Handler;           /* 20 Basic Timer Counter 7 */
  };
  union {
    void* pfnADC_OVERRUN_Handler;         /* 21 Analog Digital Converter */
    void* pfnADC_READY_Handler;           /* 21 Analog Digital Converter */
    void* pfnADC_RESRDY_Handler;          /* 21 Analog Digital Converter */
    void* pfnADC_WINMON_Handler;          /* 21 Analog Digital Converter */
  };
  union {
    void* pfnAC_COMP_0_Handler;           /* 22 Analog Comparators */
    void* pfnAC_COMP_1_Handler;           /* 22 Analog Comparators */
    void* pfnAC_WIN_0_Handler;            /* 22 Analog Comparators */
  };
  union {
    void* pfnDAC_EMPTY_Handler;           /* 23 Digital Analog Converter */
    void* pfnDAC_READY_Handler;           /* 23 Digital Analog Converter */
    void* pfnDAC_UNDERRUN_Handler;        /* 23 Digital Analog Converter */
  };
  union {
    void* pfnPTC_EOC_Handler;             /* 24 Peripheral Touch Controller */
    void* pfnPTC_READY_Handler;           /* 24 Peripheral Touch Controller */
    void* pfnPTC_WCOMP_Handler;           /* 24 Peripheral Touch Controller */
  };
} DeviceVectors;

/* Cortex-M0+ processor handlers */
void Reset_Handler               ( void );
void NonMaskableInt_Handler      ( void );
void HardFault_Handler           ( void );
void SVCall_Handler              ( void );
void PendSV_Handler              ( void );
void SysTick_Handler             ( void );

/* Peripherals handlers */
void PM_CFD_Handler              ( void );
void PM_CKRDY_Handler            ( void );
void SYSCTRL_BOD12DET_Handler    ( void );
void SYSCTRL_BOD12RDY_Handler    ( void );
void SYSCTRL_BOD12SYNRDY_Handler ( void );
void SYSCTRL_BOD33DET_Handler    ( void );
void SYSCTRL_BOD33RDY_Handler    ( void );
void SYSCTRL_BOD33SYNRDY_Handler ( void );
void SYSCTRL_DFLLLOCKC_Handler   ( void );
void SYSCTRL_DFLLLOCKF_Handler   ( void );
void SYSCTRL_DFLLOOB_Handler     ( void );
void SYSCTRL_DFLLRCS_Handler     ( void );
void SYSCTRL_DFLLRDY_Handler     ( void );
void SYSCTRL_OSC32KRDY_Handler   ( void );
void SYSCTRL_XOSCRDY_Handler     ( void );
void SYSCTRL_XOSC32RDY_Handler   ( void );
void WDT_EW_Handler              ( void );
void RTC_CMP_0_Handler           ( void );
void RTC_CMP_1_Handler           ( void );
void RTC_OVF_Handler             ( void );
void RTC_READY_Handler           ( void );
void EIC_EXTINT_0_Handler        ( void );
void EIC_EXTINT_1_Handler        ( void );
void EIC_EXTINT_2_Handler        ( void );
void EIC_EXTINT_3_Handler        ( void );
void EIC_EXTINT_4_Handler        ( void );
void EIC_EXTINT_5_Handler        ( void );
void EIC_EXTINT_6_Handler        ( void );
void EIC_EXTINT_7_Handler        ( void );
void EIC_EXTINT_8_Handler        ( void );
void EIC_EXTINT_9_Handler        ( void );
void EIC_EXTINT_10_Handler       ( void );
void EIC_EXTINT_11_Handler       ( void );
void EIC_EXTINT_12_Handler       ( void );
void EIC_EXTINT_13_Handler       ( void );
void EIC_EXTINT_14_Handler       ( void );
void EIC_EXTINT_15_Handler       ( void );
void NVMCTRL_0_Handler           ( void );
void NVMCTRL_1_Handler           ( void );
void EVSYS_EVD_0_Handler         ( void );
void EVSYS_EVD_1_Handler         ( void );
void EVSYS_EVD_2_Handler         ( void );
void EVSYS_EVD_3_Handler         ( void );
void EVSYS_EVD_4_Handler         ( void );
void EVSYS_EVD_5_Handler         ( void );
void EVSYS_EVD_6_Handler         ( void );
void EVSYS_EVD_7_Handler         ( void );
void EVSYS_OVR_0_Handler         ( void );
void EVSYS_OVR_1_Handler         ( void );
void EVSYS_OVR_2_Handler         ( void );
void EVSYS_OVR_3_Handler         ( void );
void EVSYS_OVR_4_Handler         ( void );
void EVSYS_OVR_5_Handler         ( void );
void EVSYS_OVR_6_Handler         ( void );
void EVSYS_OVR_7_Handler         ( void );
void SERCOM0_0_Handler           ( void );
void SERCOM0_1_Handler           ( void );
void SERCOM0_2_Handler           ( void );
void SERCOM0_3_Handler           ( void );
void SERCOM1_0_Handler           ( void );
void SERCOM1_1_Handler           ( void );
void SERCOM1_2_Handler           ( void );
void SERCOM1_3_Handler           ( void );
void SERCOM2_0_Handler           ( void );
void SERCOM2_1_Handler           ( void );
void SERCOM2_2_Handler           ( void );
void SERCOM2_3_Handler           ( void );
void SERCOM3_0_Handler           ( void );
void SERCOM3_1_Handler           ( void );
void SERCOM3_2_Handler           ( void );
void SERCOM3_3_Handler           ( void );
void SERCOM4_0_Handler           ( void );
void SERCOM4_1_Handler           ( void );
void SERCOM4_2_Handler           ( void );
void SERCOM4_3_Handler           ( void );
void SERCOM5_0_Handler           ( void );
void SERCOM5_1_Handler           ( void );
void SERCOM5_2_Handler           ( void );
void SERCOM5_3_Handler           ( void );
void TC0_ERR_Handler             ( void );
void TC0_MC_0_Handler            ( void );
void TC0_MC_1_Handler            ( void );
void TC0_OVF_Handler             ( void );
void TC0_READY_Handler           ( void );
void TC1_ERR_Handler             ( void );
void TC1_MC_0_Handler            ( void );
void TC1_MC_1_Handler            ( void );
void TC1_OVF_Handler             ( void );
void TC1_READY_Handler           ( void );
void TC2_ERR_Handler             ( void );
void TC2_MC_0_Handler            ( void );
void TC2_MC_1_Handler            ( void );
void TC2_OVF_Handler             ( void );
void TC2_READY_Handler           ( void );
void TC3_ERR_Handler             ( void );
void TC3_MC_0_Handler            ( void );
void TC3_MC_1_Handler            ( void );
void TC3_OVF_Handler             ( void );
void TC3_READY_Handler           ( void );
void TC4_ERR_Handler             ( void );
void TC4_MC_0_Handler            ( void );
void TC4_MC_1_Handler            ( void );
void TC4_OVF_Handler             ( void );
void TC4_READY_Handler           ( void );
void TC5_ERR_Handler             ( void );
void TC5_MC_0_Handler            ( void );
void TC5_MC_1_Handler            ( void );
void TC5_OVF_Handler             ( void );
void TC5_READY_Handler           ( void );
void TC6_ERR_Handler             ( void );
void TC6_MC_0_Handler            ( void );
void TC6_MC_1_Handler            ( void );
void TC6_OVF_Handler             ( void );
void TC6_READY_Handler           ( void );
void TC7_ERR_Handler             ( void );
void TC7_MC_0_Handler            ( void );
void TC7_MC_1_Handler            ( void );
void TC7_OVF_Handler             ( void );
void TC7_READY_Handler           ( void );
void ADC_OVERRUN_Handler         ( void );
void ADC_READY_Handler           ( void );
void ADC_RESRDY_Handler          ( void );
void ADC_WINMON_Handler          ( void );
void AC_COMP_0_Handler           ( void );
void AC_COMP_1_Handler           ( void );
void AC_WIN_0_Handler            ( void );
void DAC_EMPTY_Handler           ( void );
void DAC_READY_Handler           ( void );
void DAC_UNDERRUN_Handler        ( void );
void PTC_EOC_Handler             ( void );
void PTC_READY_Handler           ( void );
void PTC_WCOMP_Handler           ( void );

